---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MaximumNumberOfPolesExceeded
source: html/16fdfe1d-f3c8-7b82-e579-1fc3e5bca558.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MaximumNumberOfPolesExceeded Property

You cannot add more poles to this spare, as doing so would exceed the maximum number of poles set for this equipment.

## Syntax (C#)
```csharp
public static FailureDefinitionId MaximumNumberOfPolesExceeded { get; }
```